[AdvancedModularWeapons X2TechTemplate]
DisplayName="Advanced Modular Weapons"
Summary="The plasma rifles used by the aliens are incredibly complex weapons. The rifles themselves self-destruct when their original operator dies, but with a little effort we might be able to use any recovered parts to improve our soldiers' own weapons."
CodeName="Tinker"
LongDescription="We've had the troops digging through scrap piles and looting corpses, and at this point, it's safe to assume they're on constant vigil for anything we could use to improve our gear. All the raw materials in the world won't mean much if I can't find a use for them, but I think this advanced modular weapon system is a good start. Having pushed our existing designs about as far as I thought possible, the integration of a few key alien components provided the much needed stability we've been looking for. With these modifications in place, we should be able to attach more upgrades for even more firepower. The troops will like that. L. Shen."
UnlockedDescription="Additional Upgrade Slot Unlocked"